export const unshiftedKeysLayout = [
  ["`", "۱", "۲", "۳", "۴", "۵", "٦", "۷", "۸", "۹", "۰", "-", "=", "Delete"],
  ["Tab", "ق", "و", "ع", "ر", "ت", "ے", "ء", "ی", "ہ", "پ", "[", "]", "\\"],
  ["Caps", "ا", "س", "د", "ف", "گ", "ح", "ج", "ک", "ل", "؛", "'", "Enter"],
  ["Shift", "ز", "ش", "چ", "ط", "ب", "ن", "م", "،", "۔", "/", "Shift"],
  ["Ctrl", "Alt", "Space", "Alt", "Ctrl"],
];

export const shiftedKeysLayout = [
  ["~", "!", "@", "#", "٪", "ﷲ", "ٔ", "،", "*", ")", "(", "_", "+", "Delete"],
  ["Tab", "ٰ", "ُ", "ٗ", "ڑ", "ٹ", "ۓ", "ّ", "َ", "ۂ", "ﷺ", "{", "}", "|"],
  ["Caps", "آ", "ص", "ڈ", "ﷲ", "غ", "ح", "ژ", "خ", "ُ", ":", "\"", "Enter"],
  ["Shift", "ذ", "ً", "ٔ", "ظ", "ب", "ں", "؟", ">", "ّ", "؟", "Shift"],
  ["Ctrl", "Alt", "Space", "Alt", "Ctrl"],
];

export const capsKeysLayout = [
  ["`", "۱", "۲", "۳", "۴", "۵", "٦", "۷", "۸", "۹", "۰", "-", "=", "Delete"],
  ["Tab", "ٰ", "ُ", "ٗ", "ڑ", "ٹ", "ۓ", "ّ", "َ", "ۂ", "ﷺ", "[", "]", "\\"],
  ["Caps", "آ", "ص", "ڈ", "ﷲ", "غ", "ح", "ژ", "خ", "ُ", "؛", "'", "Enter"],
  ["Shift", "ذ", "ً", "ٔ", "ظ", "ب", "ں", "؟", "،", "۔", "/", "Shift"],
  ["Ctrl", "Alt", "Space", "Alt", "Ctrl"],
];

export const englishHintKeysLayout = [
  ["`", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Delete"],
  ["Tab", "Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "[", "]", "\\"],
  ["Caps", "A", "S", "D", "F", "G", "H", "J", "K", "L", ";", "'", "Enter"],
  ["Shift", "Z", "X", "C", "V", "B", "N", "M", ",", ".", "/", "Shift"],
  ["Ctrl", "Alt", "Space", "Alt", "Ctrl"],
];
